{
  "tweets": "Today it’s been reported that 1,000 Sure Start Centres have closed since 2010.The have opted for tax cuts for a wealthy elite rather than fund children and young people’s services. Sums up this Government.Instead of taking action on air pollution that kills 40,000 people a year, the have spent over half a million pounds of taxpayers' money fighting three failed court cases. This Tory Government has utterly failed families across our country.They have opted for tax cuts for a wealthy elite rather than fund children and young people’s services. When became Prime Minister she said: “If you’re one of those families just managing...the Government I lead will be driven not by the interests of the privileged few, but by yours.” Nothing could be further from the truth. Ahead of the local elections, I've been out campaigning with and On 3 May, you can elect Labour councillors to protect your community from the worst of Tory austerity.But we need you to campaign with us to make that happen: Today Labour launched our National Education Service consultation.Like our country’s greatest institution, the NHS, our National Education Service will provide cradle-to-grave learning for all, free at the point of use. Help us develop our NES plans: In exactly one month, on Thursday 3 May, you will be able to elect Labour councillors and mayors who will protect your community from the worst of Tory cuts.But we need you to campaign with us so we can win: On WorldAutismAwarenessDay please watch powerful film about what many autistic people experience when faced with unexpected changes.One in 100 people are on the autism spectrum. Let's use today to learn more about how we can best support people with autism. 100 years ago today, the RAF was founded. We give our thanks to everyone who has served and continues to serve, and remember the brave pilots who played a vital role in defeating fascism in World War II. RAF100 I would like to wish Christians in our country and around the world a happy Easter. This is very welcome and wonderful news. A simple piece of dignity for bereaved families.Huge credit to and the Sunday Mirror who tirelessly kept up the pressure when the Government was dragging its feet. The killing and wounding by Israeli forces of civilians demonstrating for Palestinian rights in Gaza is appalling.The UK Government must make its voice heard on the urgency of a genuine settlement for peace and justice. Under this Tory Government housebuilding has fallen to its lowest level since the 1920s. But despite this, Labour councils, like in Milton Keynes, are using their powers to build the homes our communities need. As Jews across our country start to prepare for Passover, I would like to wish everyone in the Jewish community a Chag Sameach. The takeover of GKN must be stopped. This is about people's jobs, national security and our whole industrial strategy.Labour is calling on to step in and act in the national interest, instead of serving the interests of city speculators. What a wonderful letter from to Manchester's firefighters. Labour will always stand shoulder to shoulder with our emergency workers, who put themselves in harm's way to keep us safe. . has overseen the loss of 20,000 police officers from our streets as Home Secretary and as Prime Minister.You cannot protect communities on the cheap.Labour will recruit 10,000 police officers and give our forces the resources they need. You know things are bad when the Daily Mail calls out a rigged economic system.The Tories have put the interests of city speculators over people's jobs.Labour would have stopped the takeover of GKN and in government we'll make our economy work for the many, not the few. Yesterday Google announced its UK tax bill will be just £50 million despite nearly £6 billion of sales in our country.As our public services are being slashed, the Tories are letting an elite few get away with not paying their fair share.We're not broke, we're being robbed. Today I was interviewed by Antisemitism is a cancer in our society which has surfaced in our party, Britain and Europe in recent years.Seeing the hurt in the Jewish community makes me determined to challenge antisemitism at every stage. Today I asked if she will commit to ring-fencing NHS mental health budgets to support those who need our support. PMQs I have written to the Board of Deputies and the Jewish Leadership Council. I will never be anything other than a militant opponent of antisemitism. In this fight, I am an ally and always will be. Labour is an anti-racist party and I utterly condemn antisemitism, which is why as leader of the Labour Party I want to be clear that I will not tolerate any form of antisemitism that exists in and around our movement. Yesterday, we got started with our people powered mass meetings - where people from all backgrounds come together to share their stories and commit to campaign. We’ve only got five weeks to go until the local elections. We need you to join our campaign now. Well done to who has tirelessly led this campaign and is forcing the Government to act. No parent who has gone through the heartbreaking experience of losing a child should be left struggling to cover the cost of a funeral. It's shocking that has refused to intervene in this case that I raised last week at PMQs.Mr Thompson has lived and worked in this country for 44 years but is being denied cancer treatment. At PMQs I was pleased to wish a happy Newroz to those in the Middle East and all around the world. Yesterday Labour launched our local elections campaign.On Thursday 3 May you will have the chance to send an unmistakable message to this Conservative Government that enough is enough. Our elderly are neglected for lack of social care. Decent people who have contributed all their lives are not being given the dignity in retirement they deserve.It doesn’t have to be like this. Labour in government would do things very differently. On Thursday 3 May you can send this Tory Government a message to say enough of cuts to our police force.There are 20,000 fewer police on our streets since 2010 and today the police inspectorate is warning that 999 calls are sometimes not responded to for days. The country’s housing crisis is deepening. It’s a crisis that has left 120,000 children in temporary accommodation without a home to call their own. That’s up two-thirds since 2010.Labour will build the homes people need and ensure developers build genuinely affordable housing. Over the last eight years, the Tories have cut councils’ budgets in half.In that same time, the Tories have slashed corporation tax, cut the bank levy, abolished the top tax rate on high earners and cut capital gains tax for the very richest.Austerity is a political choice. In the local elections on Thursday 3 May you will be able to send a message to this Government to say: enough of cuts to vital services that hurt local communities, enough of cuts to schools, hospitals and local policing. Today we launched our local elections campaign in Trafford.On Thursday 3 May you will have the chance to send an unmistakable message to this Conservative Government that enough is enough. Today we remember PC Keith Palmer and all those murdered and injured in the Westminster attack one year ago. Hate filled terror will not divide us nor deter us from building a world based on peace and human rights. This Conservative Government has slashed public services and expects local councils to pick up the pieces. PMQs Congratulations to Jennie Formby, the new General Secretary of our party. Her talent, experience and commitment will play a crucial role in building on last year's General Election result, helping to lead into government to transform society for the many not the few. We need Labour run councils across our country, like the one in North Ayrshire that protects its community from austerity. In Scotland, we were told that Labour was dying but in 2017 you elected six new Scottish Labour MPs and we came close to winning around 20 more. Working together, we can win back Scotland at the next General Election. Last year, thousands of members helped us to create our election manifesto 'For the Many, Not the Few', which gained the support of millions of voters.Now Labour members can help us build on those policies and prepare for the next election: In this powerful article explains how he was addicted to Fixed Odds Betting Terminals and why the stake should be cut to £2, as Labour pledged in our manifesto.I know Matt and I know how committed he is to this. People's lives have been devastated because of Fixed Odds Betting Terminals. The can still act and prevent much of the harm FOBTs cause by reducing it to £2 a spin, as Labour pledged in our manifesto. On 3 May we need to elect Labour councillors and mayors across the country who will protect communities from the worst of Tory austerity.But we can only do this if we get active - so come out to campaign with me and other Labour supporters this Saturday: Healthcare is a human right. The government must intervene immediately in this case to ensure that Mr Thompson gets the care he needs. We need Labour-led councils, like in Carlisle, across the country. Labour councils will protect communities from the worst of austerity which last week’s Spring Statement showed the Tories have no plans to abandon. As part of an effective response to the Salisbury attack, the Government should introduce an Oligarch Levy and other measures to tackle corruption and stop the flow of dirty money into the UK. Neo-liberalism is an ideology that ruins communities and ruins lives. It's an ideology that this Government is still absolutely wedded to as they continue to wreak havoc with their incessant cuts. LabNorth18 Today I am supporting the FamiliesTogether Bill to change the unfair Home Office rules which prevent refugee children bringing their close family members to join them in the same way an adult can.Labour respects the right to a family life. On Tuesday, the Chancellor Philip Hammond delivered a SpringStatement which ignored the crisis that eight years of austerity has created in our economy. You cannot cut your way to prosperity. The use of nerve agents on our streets is barbaric and beyond reckless.The Russian authorities must be held to account. And the Government must do more to tackle the oligarchs and their ill-gotten cash. Today, university staff take their 13th day of strike action to defend their pensions. Our education staff deserve security in retirement. I urge to return for fresh negotiations with to end this dispute and avoid further disruption to students. Are you under 27 years old and a member of the Labour Party? If you are, then you have until midday tomorrow to elect your Young Labour representatives. Today marks four years since we lost Tony Benn. It was lovely to catch up with to remember her father, a titan of our movement and a great friend of mine. Today, I asked whether she agrees that NHS funding is inadequate. PMQs The attack in Salisbury was an appalling act of violence, which we condemn in the strongest terms.The Russian authorities must be held to account on the basis of the evidence and our response must be both decisive and proportionate. Another indictment of the Tories' failed economic project.This report predicts 1.5 million more children will be forced into poverty by 2022, and shows that disabled people and single parents are bearing the brunt of the Tories’ spending cuts. Shameful. Stephen Hawking inspired the world with his determination to explain the mysteries of the cosmos. But he also showed breathtaking courage to overcome life's adversities and a burning passion to protect our National Health Service. He will be greatly missed. The Tories have just been forced to delay closing the childcare vouchers scheme for at least six months due to pressure from Labour, led by It's clear has neither a majority nor a mandate for abolishing childcare vouchers. The Tories and the DUP have just voted through cuts to free school meals in England.The Tories bought the DUP's support by excluding Northern Ireland from these cuts.A disgraceful tactic which is playing politics with the health of our children. The disgusting hate-filled letters and packages sent to Muslim fellow citizens and colleagues in Parliament are utterly contemptible. My full statement here: . is right to call out this hate speech, all too often fuelled by sections of the media and politicians. endthehate The are protecting Northern Ireland from cuts to free school meals so the DUP doesn't vote with Labour on Tuesday.Disgraceful. These cuts are wrong and shouldn't apply anywhere in the UK. Labour is preparing for government. Here brilliantly explains how we will serve in the interests of the many, not just the privileged few. This is damning. The Grenfell survivors deserve justice. Yesterday, on International Women’s Day I met inspirational women, from business leaders in Alfreton to students and local councillors in Hucknall. IWD2018 In 1970 Labour introduced the Equal Pay Act, but nearly 50 years later unequal pay still persists. Today, launched Labour’s policy to close the gender pay gap and ensure equal pay for equal work. IWD2018 "
}