{
  "tweets": "Sums up this Government.Instead of taking action on air pollution that kills 40,000 people a year, the… This Tory Government has utterly failed families across our country.They have opted for tax cuts for a wealthy el… When became Prime Minister she said: “If you’re one of those families just managing...the Government I… Ahead of the local elections, I've been out campaigning with and On 3 May, you can ele… Today Labour launched our National Education Service consultation.Like our country’s greatest institution, the NH… In exactly one month, on Thursday 3 May, you will be able to elect Labour councillors and mayors who will protect y… On WorldAutismAwarenessDay please watch powerful film about what many autistic people experience when fa… 100 years ago today, the RAF was founded. We give our thanks to everyone who has served and continues to serve, and… I would like to wish Christians in our country and around the world a happy Easter. This is very welcome and wonderful news. A simple piece of dignity for bereaved families.Huge credit to… The killing and wounding by Israeli forces of civilians demonstrating for Palestinian rights in Gaza is appalling.… Under this Tory Government housebuilding has fallen to its lowest level since the 1920s. But despite this, Labour c… As Jews across our country start to prepare for Passover, I would like to wish everyone in the Jewish community a… The takeover of GKN must be stopped. This is about people's jobs, national security and our whole industrial strate… What a wonderful letter from to Manchester's firefighters. Labour will always stand shoulder to shoulder… . has overseen the loss of 20,000 police officers from our streets as Home Secretary and as Prime Minis… You know things are bad when the Daily Mail calls out a rigged economic system.The Tories have put the interests… Yesterday Google announced its UK tax bill will be just £50 million despite nearly £6 billion of sales in our count… Today I was interviewed by Antisemitism is a cancer in our society which has surfaced in our party,… Today I asked if she will commit to ring-fencing NHS mental health budgets to support those who need o… I have written to the Board of Deputies and the Jewish Leadership Council. I will never be anything other than a mi… Labour is an anti-racist party and I utterly condemn antisemitism, which is why as leader of the Labour Party I wan… Yesterday, we got started with our people powered mass meetings - where people from all backgrounds come together t… Well done to who has tirelessly led this campaign and is forcing the Government to act. No paren… It's shocking that has refused to intervene in this case that I raised last week at PMQs.Mr Thompso… At PMQs I was pleased to wish a happy Newroz to those in the Middle East and all around the world. Yesterday Labour launched our local elections campaign.On Thursday 3 May you will have the chance to send an unmi… Our elderly are neglected for lack of social care. Decent people who have contributed all their lives are not being… On Thursday 3 May you can send this Tory Government a message to say enough of cuts to our police force.There are… The country’s housing crisis is deepening. It’s a crisis that has left 120,000 children in temporary accommodation… Over the last eight years, the Tories have cut councils’ budgets in half.In that same time, the Tories have slash… In the local elections on Thursday 3 May you will be able to send a message to this Government to say: enough of cu… "
}