{
  "tweets": "Idea. Try the unfollow button. Thank you, sir Precisely so. I stand with you, sir. X. London murder update. 50yr old beaten to death50 murders in 2018 GetKhanOut We are many. Our voices may be silenced but our spirit is not. We stand united against the Establishment, their narrative & the fall of our country. We standstrong for Britain. America. A 78 year old Brit, attacked in his home at night by 2 young men & threatened with screwdriver. He fought back & killed one. (Hero)British Police response: arrest the elderly pensioner, hold in cell on suspicion of murder. Do not let yourself fall as we have fallen The death of Europe. With thanks to & The Center for Security Policy London murder update. 20yr old stabbed to death 49 in 2018. GetKhanOut Thank you Thank you sir. Police too afraid of being ‘racist’ in their policing to actually save black kids being stabbed. Dear I apologise for the . Detail was never their thing. I see Boris is advertising for a food taster... Solving London’s gun / knife epidemic:1) Detailed profiling of all offenders 2) Quadruple STOP & SEARCH using profiling dataGetKhanOut Dear now you’ve deleted your tweet, does it mean the Cold War is off and we can all play football together nicely? Russia London overnight murder update. 16 yr old boy gunned down dies from injuries. 2 dead. ZuckSchumer. Great work. Wait? You had a thought Can I ask what thought you had before your tweet on Winnie? You do know what her special necklace is? I sat down with Sabo, ahead of his latest campaign... READ ZuckSchumer Stealing fries from Sabo ahead of his latest campaign. An EXCLUSIVE for Fascinating.... controlled narrative across USA & U.K.? Thank you, sir. Many Brits refuse to take their children to London. It is not a safe city and our leaders are content to manage its decline. Thank you ma’am. The state will continue to try to silence me too. Resist the narrative. Remember your truths. And standstrong. Xxx Dear “HOLY SHIT That fellas been at it more than me. And I’m the frickin’ rabbit”. Dear - professional opinion please - would London be a safer city if we had adequate gun control - like you advocate for America? *coughs* Agreed. Unnecessary. And particularly unpleasant. Indeed. Anyone using it is complicit My personal take? A professionally-orchestrated and well funded exercise to control the narrative and deflect from Labours present crises. FalseFlags Anyone using this hashtag is complicit. You are part of the problem. Be better than this. Ps cow backwards is woc. For those kindly asking - my award-winning documentary on my journey to fat and back is right here: Katie Hopkins: My Fat Story by Katie Hopkins: My Fat Story TuesdayThoughts London. Overnight Murder update: 17yr old girl shot16yr old boy gunned down15yr old boy stabbed. LondonHasFallen People are cowed. People are afraid. In Great Britain we are not united, we are more divided that at any time in our history via Sadiq used the Clinton / Obama method. 1) Import Muslim voters / 2) turn blind eye to voter turnout of 250% 3) play the minority struggle card. With their necklaces and their matches the will mark the death of Winnie Mandela. I fear for my friends. plaasmoorde LondonIsOpen. So too the morgues. This is your legacy SadiqKhan "
}