{
  "tweets": "The Fake News Washington Post, Amazon’s “chief lobbyist,” has another (of many) phony headlines, “Trump Defiant As China Adds Trade Penalties.” WRONG! Should read, “Trump Defiant as U.S. Adds Trade Penalties, Will End Barriers And Massive I.P. Theft.” Typically bad reporting! The Caravan is largely broken up thanks to the strong immigration laws of Mexico and their willingness to use them so as not to cause a giant scene at our Border. Because of the Trump Administrations actions, Border crossings are at a still UNACCEPTABLE 46 year low. Stop drugs! “Still Rising: Rasmussen Poll Shows Donald Trump Approval Ratings Now at 51 Percent” Today we honor Dr. Martin Luther King, Jr. on the 50th anniversary of his assassination. Earlier this year I spoke about Dr. King’s legacy of justice and peace, and his impact on uniting Americans. MLK50 Proclamation: Our thoughts and prayers are with the four U.S. Marines from the 3rd Marine Aircraft Wing who lost their lives in yesterday’s Southern California helicopter crash. We pray for their families, and our great When you’re already $500 Billion DOWN, you can’t lose! We are not in a trade war with China, that war was lost many years ago by the foolish, or incompetent, people who represented the U.S. Now we have a Trade Deficit of $500 Billion a year, with Intellectual Property Theft of another $300 Billion. We cannot let this continue! Our Border Laws are very weak while those of Mexico & Canada are very strong. Congress must change these Obama era, and other, laws NOW! The Democrats stand in our way - they want people to pour into our country unchecked....CRIME! We will be taking strong action today. Was just briefed on the shooting at YouTube’s HQ in San Bruno, California. Our thoughts and prayers are with everybody involved. Thank you to our phenomenal Law Enforcement Officers and First Responders that are currently on the scene. WE WILL PROTECT OUR SOUTHERN BORDER! Today, it was my honor to welcome Estonia President Lithuania President and Latvia President to the Congratulations on your 100th anniversaries of independence! BalticSummit: I am right about Amazon costing the United States Post Office massive amounts of money for being their Delivery Boy. Amazon should pay these costs (plus) and not have them bourne by the American Taxpayer. Many billions of dollars. P.O. leaders don’t have a clue (or do they?)! Thank you to Rasmussen for the honest polling. Just hit 50%, which is higher than Cheatin’ Obama at the same time in his Administration. Check out the fact that you can’t get a job at ratings challenged unless you state that you are totally anti-Trump? Little Jeff Zuker, whose job is in jeopardy, is not having much fun lately. They should clean up and strengthen CNN and get back to honest reporting! The big Caravan of People from Honduras, now coming across Mexico and heading to our “Weak Laws” Border, had better be stopped before it gets there. Cash cow NAFTA is in play, as is foreign aid to Honduras and the countries that allow this to happen. Congress MUST ACT NOW! The Fake News Networks, those that knowingly have a sick and biased AGENDA, are worried about the competition and quality of Sinclair Broadcast. The “Fakers” at CNN, NBC, ABC & CBS have done so much dishonest reporting that they should only be allowed to get awards for fiction! AutismAwarenessDay LightItUpBlue “President Trump's approval rate among likely U.S. voters hit 50 percent on Monday, which puts him higher than former President Barack Obama's score at the same point into his first term, according to a new poll.” Via: 39% of my nominations, including Diplomats to foreign lands, have not been confirmed due to Democrat obstruction and delay. At this rate, it would take more than 7 years before I am allowed to have these great people start working. Never happened before. Disgraceful! Honduras, Mexico and many other countries that the U.S. is very generous to, sends many of their people to our country through our WEAK IMMIGRATION POLICIES. Caravans are heading here. Must pass tough laws and build the WALL. Democrats allow open borders, drugs and crime! As ridiculous as it sounds, the laws of our country do not easily allow us to send those crossing our Southern Border back where they came from. A whole big wasted procedure must take place. Mexico & Canada have tough immigration laws, whereas ours are an Obama joke. ACT CONGRESS “President Donald J. Trump Proclaims April 2, 2018, World Autism Awareness Day” An honor to host the Annual Easter Egg Roll! So sad that the Department of “Justice” and the FBI are slow walking, or even not giving, the unredacted documents requested by Congress. An embarrassment to our country! Only fools, or worse, are saying that our money losing Post Office makes money with Amazon. THEY LOSE A FORTUNE, and this will be changed. Also, our fully tax paying retailers are closing stores all over the country...not a level playing field! So funny to watch Fake News Networks, among the most dishonest groups of people I have ever dealt with, criticize Sinclair Broadcasting for being biased. Sinclair is far superior to CNN and even more Fake NBC, which is a total joke. Mexico is making a fortune on NAFTA...They have very strong border laws - ours are pathetic. With all of the money they make from the U.S., hopefully they will stop people from coming through their country and into ours, at least until Congress changes our immigration laws! DACA is dead because the Democrats didn’t care or act, and now everyone wants to get onto the DACA bandwagon... No longer works. Must build Wall and secure our borders with proper Border legislation. Democrats want No Borders, hence drugs and crime! ...Congress must immediately pass Border Legislation, use Nuclear Option if necessary, to stop the massive inflow of Drugs and People. Border Patrol Agents (and ICE) are GREAT, but the weak Dem laws don’t allow them to do their job. Act now Congress, our country is being stolen! Mexico has the absolute power not to let these large “Caravans” of people enter their country. They must stop them at their Northern Border, which they can do because their border laws work, not allow them to pass through into our country, which has no effective border laws..... These big flows of people are all trying to take advantage of DACA. They want in on the act! Mexico is doing very little, if not NOTHING, at stopping people from flowing into Mexico through their Southern Border, and then into the U.S. They laugh at our dumb immigration laws. They must stop the big drug and people flows, or I will stop their cash cow, NAFTA. NEED WALL! Border Patrol Agents are not allowed to properly do their job at the Border because of ridiculous liberal (Democrat) laws like Catch & Release. Getting more dangerous. “Caravans” coming. Republicans must go to Nuclear Option to pass tough laws NOW. NO MORE DACA DEAL! HAPPY EASTER! Governor Jerry “Moonbeam” Brown pardoned 5 criminal illegal aliens whose crimes include (1) Kidnapping and Robbery (2) Badly beating wife and threatening a crime with intent to terrorize (3) Dealing drugs. Is this really what the great people of California want? ...does not include the Fake Washington Post, which is used as a “lobbyist” and should so REGISTER. If the P.O. “increased its parcel rates, Amazon’s shipping costs would rise by $2.6 Billion.” This Post Office scam must stop. Amazon must pay real costs (and taxes) now! While we are on the subject, it is reported that the U.S. Post Office will lose $1.50 on average for each package it delivers for Amazon. That amounts to Billions of Dollars. The Failing N.Y. Times reports that “the size of the company’s lobbying staff has ballooned,” and that... Washington spent trillions building up foreign countries while allowing OUR OWN infrastructure to fall into a state of total disrepair. No more! It's time to REBUILD, and we will do it with American WORKERS, American GRIT, and American PRIDE! JOBS, JOBS, JOBS! Unemployment claims have fallen to a 45-year low. Together, we are making the economy great again! We are going to REBUILD our crumbling infrastructure, and there is no better place to begin this campaign than in the Great State of Ohio. A tremendous honor to be here today at a state-of-the-art training site, where the skills of the American Worker are forged and refined! I have stated my concerns with Amazon long before the Election. Unlike others, they pay little or no taxes to state & local governments, use our Postal System as their Delivery Boy (causing tremendous loss to the U.S.), and are putting many thousands of retailers out of business! ....In the interim, Hon. Robert Wilkie of DOD will serve as Acting Secretary. I am thankful for Dr. David Shulkin’s service to our country and to our GREAT VETERANS! I am pleased to announce that I intend to nominate highly respected Admiral Ronny L. Jackson, MD, as the new Secretary of Veterans Affairs.... Great briefing this afternoon on the start of our Southern Border WALL! ....release known dangerous criminals into communities across the State. All citizens have the right to be protected by Federal law and strong borders. My Administration stands in solidarity with the brave citizens in Orange County defending their rights against California's illegal and unconstitutional Sanctuary policies. California's Sanctuary laws.... . just announced an agreement in principle with South Korea on KORUS! A great deal for American and Korean workers. Let’s now focus on our important security relationship. Received message last night from XI JINPING of China that his meeting with KIM JONG UN went very well and that KIM looks forward to his meeting with me. In the meantime, and unfortunately, maximum sanctions and pressure must be maintained at all cost! For years and through many administrations, everyone said that peace and the denuclearization of the Korean Peninsula was not even a small possibility. Now there is a good chance that Kim Jong Un will do what is right for his people and for humanity. Look forward to our meeting! THE SECOND AMENDMENT WILL NEVER BE REPEALED! As much as Democrats would like to see this happen, and despite the words yesterday of former Supreme Court Justice Stevens, NO WAY. We need more Republicans in 2018 and must ALWAYS hold the Supreme Court! I am very pleased to welcome the opioid memorial to the President's Park in April. I encourage all to visit and remember those who we have lost to this deadly epidemic. We will keep fighting until we defeat the opioid crisis! Trade talks going on with numerous countries that, for many years, have not treated the United States fairly. In the end, all will be happy! Great news! MAGA So much Fake News. Never been more voluminous or more inaccurate. But through it all, our country is doing great! The economy is looking really good. It has been many years that we have seen these kind of numbers. The underlying strength of companies has perhaps never been better. . just wrote a book which everyone is talking about. He was a great help. He is a veteran journalist who had a great influence in NH and beyond. He calls it the most amazing political campaign of modern times. The book is called, “What Really Happened.” Enjoy! MAGA “President Donald J. Trump Proclaims March 25, 2018, as Greek Independence Day: A National Day of Celebration of Greek and American Democracy” Happy National MedalOfHonorDay to our HEROES. We love you! ....lawyer or law firm will take months to get up to speed (if for no other reason than they can bill more), which is unfair to our great country - and I am very happy with my existing team. Besides, there was NO COLLUSION with Russia, except by Crooked Hillary and the Dems! Many lawyers and top law firms want to represent me in the Russia case...don’t believe the Fake News narrative that it is hard to find a lawyer who wants to take this on. Fame & fortune will NEVER be turned down by a lawyer, though some are conflicted. Problem is that a new...... Much can be done with the $1.6 Billion given to building and fixing the border wall. It is just a down payment. Work will start immediately. The rest of the money will come - and remember DACA, the Democrats abandoned you (but we will not)! Because of the $700 & $716 Billion Dollars gotten to rebuild our Military, many jobs are created and our Military is again rich. Building a great Border Wall, with drugs (poison) and enemy combatants pouring into our Country, is all about National Defense. Build WALL through M! France honors a great hero. Officer died after bravely swapping places with hostage in ISIS related terror attack. So much bravery around the world constantly fighting radical Islamic terrorism. Even stronger measures needed, especially at borders! Our thoughts and prayers are with the victims of the horrible attack in France yesterday, and we grieve the nation’s loss. We also condemn the violent actions of the attacker and anyone who would provide him support. We are with you As a matter of National Security I've signed the Omnibus Spending Bill. I say to Congress: I will NEVER sign another bill like this again. To prevent this omnibus situation from ever happening again, I'm calling on Congress to give me a line-item veto for all govt spending bills! Obama Administration legalized bump stocks. BAD IDEA. As I promised, today the Department of Justice will issue the rule banning BUMP STOCKS with a mandated comment period. We will BAN all devices that turn legal weapons into illegal machine guns. News conference at the White House concerning the Omnibus Spending Bill. 1:00 P.M. I am considering a VETO of the Omnibus Spending Bill based on the fact that the 800,000 plus DACA recipients have been totally abandoned by the Democrats (not even mentioned in Bill) and the BORDER WALL, which is desperately needed for our National Defense, is not fully funded. DACA was abandoned by the Democrats. Very unfair to them! Would have been tied to desperately needed Wall. House Intelligence Committee votes to release final report. FINDINGS: (1) No evidence provided of Collusion between Trump Campaign & Russia. (2) The Obama Administrations Post election response was insufficient. (3) Clapper provided inconsistent testimony on media contacts. I am pleased to announce that, effective 4/9/18, will be my new National Security Advisor. I am very thankful for the service of General H.R. McMaster who has done an outstanding job & will always remain my friend. There will be an official contact handover on 4/9. My honor Charlie - thank you! MAGA As a candidate, I pledged that if elected I would use every lawful tool to combat unfair trade, protect American workers, and defend our national security. Today, we took another critical step to fulfill that commitment. Remember when they were saying, during the campaign, that Donald Trump is giving great speeches and drawing big crowds, but he is spending much less money and not using social media as well as Crooked Hillary’s large and highly sophisticated staff. Well, not saying that anymore! Crazy Joe Biden is trying to act like a tough guy. Actually, he is weak, both mentally and physically, and yet he threatens me, for the second time, with physical assault. He doesn’t know me, but he would go down fast and hard, crying all the way. Don’t threaten people Joe! Democrats refused to take care of DACA. Would have been so easy, but they just didn’t care. I had to fight for Military and start of Wall. Got $1.6 Billion to start Wall on Southern Border, rest will be forthcoming. Most importantly, got $700 Billion to rebuild our Military, $716 Billion next year...most ever. Had to waste money on Dem giveaways in order to take care of military pay increase and new equipment. .....They can help solve problems with North Korea, Syria, Ukraine, ISIS, Iran and even the coming Arms Race. Bush tried to get along, but didn’t have the “smarts.” Obama and Clinton tried, but didn’t have the energy or chemistry (remember RESET). PEACE THROUGH STRENGTH! I called President Putin of Russia to congratulate him on his election victory (in past, Obama called him also). The Fake News Media is crazed because they wanted me to excoriate him. They are wrong! Getting along with Russia (and others) is a good thing, not a bad thing....... “Special Council is told to find crimes, whether a crime exists or not. I was opposed to the selection of Mueller to be Special Council. I am still opposed to it. I think President Trump was right when he said there never should have been a Special Council appointed because..... ...there was no probable cause for believing that there was any crime, collusion or otherwise, or obstruction of justice!” So stated by Harvard Law Professor Alan Dershowitz. Department of Justice should have urged the Supreme Court to at least hear the Drivers License case on illegal immigrants in Arizona. I agree with Should have sought review. AUSTIN BOMBING SUSPECT IS DEAD. Great job by law enforcement and all concerned! Our Nation was founded by farmers. Our independence was won by farmers. And our continent was tamed by farmers. Our farmers always lead the way -- we are PROUD of them, and we are DELIVERING for them! NationalAgricultureDay The Democrats do not want to help DACA. Would be so easy to make a deal! A total WITCH HUNT with massive conflicts of interest! . on now! Great! 8:18 A.M. Why does the Mueller team have 13 hardened Democrats, some big Crooked Hillary supporters, and Zero Republicans? Another Dem recently added...does anyone think this is fair? And yet, there is NO COLLUSION! Spent very little time with Andrew McCabe, but he never took notes when he was with me. I don’t believe he made memos except to help his own agenda, probably at a later date. Same with lying James Comey. Can we call them Fake Memos? Wow, watch Comey lie under oath to Senator G when asked “have you ever been an anonymous source...or known someone else to be an anonymous source...?” He said strongly “never, no.” He lied as shown clearly on The Mueller probe should never have been started in that there was no collusion and there was no crime. It was based on fraudulent activities and a Fake Dossier paid for by Crooked Hillary and the DNC, and improperly used in FISA COURT for surveillance of my campaign. WITCH HUNT! The Fake News is beside themselves that McCabe was caught, called out and fired. How many hundreds of thousands of dollars was given to wife’s campaign by Crooked H friend, Terry M, who was also under investigation? How many lies? How many leaks? Comey knew it all, and much more! As the House Intelligence Committee has concluded, there was no collusion between Russia and the Trump Campaign. As many are now finding out, however, there was tremendous leaking, lying and corruption at the highest levels of the FBI, Justice & State. DrainTheSwamp Happy StPatricksDay Andrew McCabe FIRED, a great day for the hard working men and women of the FBI - A great day for Democracy. Sanctimonious James Comey was his boss and made McCabe look like a choirboy. He knew all about the lies and corruption going on at the highest levels of the FBI! “U.S. Consumer Confidence Hits 14-Year High” "
}