{
  "tweets": "“Still Rising: Rasmussen Poll Shows Donald Trump Approval Ratings Now at 51 Percent” Today we honor Dr. Martin Luther King, Jr. on the 50th anniversary of his assassination. Earlier this year I spoke… Our thoughts and prayers are with the four U.S. Marines from the 3rd Marine Aircraft Wing who lost their lives in y… When you’re already $500 Billion DOWN, you can’t lose! We are not in a trade war with China, that war was lost many years ago by the foolish, or incompetent, people who r… Our Border Laws are very weak while those of Mexico & Canada are very strong. Congress must change these Obama era,… Was just briefed on the shooting at YouTube’s HQ in San Bruno, California. Our thoughts and prayers are with everyb… WE WILL PROTECT OUR SOUTHERN BORDER! Today, it was my honor to welcome Estonia President Lithuania President and Lat… I am right about Amazon costing the United States Post Office massive amounts of money for being their Delivery Boy… Thank you to Rasmussen for the honest polling. Just hit 50%, which is higher than Cheatin’ Obama at the same time in his Administration. Check out the fact that you can’t get a job at ratings challenged unless you state that you are totally anti-T… The big Caravan of People from Honduras, now coming across Mexico and heading to our “Weak Laws” Border, had better… The Fake News Networks, those that knowingly have a sick and biased AGENDA, are worried about the competition and q… AutismAwarenessDay LightItUpBlue “President Trump's approval rate among likely U.S. voters hit 50 percent on Monday, which puts him higher than form… 39% of my nominations, including Diplomats to foreign lands, have not been confirmed due to Democrat obstruction an… Honduras, Mexico and many other countries that the U.S. is very generous to, sends many of their people to our coun… As ridiculous as it sounds, the laws of our country do not easily allow us to send those crossing our Southern Bord… “President Donald J. Trump Proclaims April 2, 2018, World Autism Awareness Day” An honor to host the Annual Easter Egg Roll! So sad that the Department of “Justice” and the FBI are slow walking, or even not giving, the unredacted documents… Only fools, or worse, are saying that our money losing Post Office makes money with Amazon. THEY LOSE A FORTUNE, an… So funny to watch Fake News Networks, among the most dishonest groups of people I have ever dealt with, criticize S… Mexico is making a fortune on NAFTA...They have very strong border laws - ours are pathetic. With all of the money… DACA is dead because the Democrats didn’t care or act, and now everyone wants to get onto the DACA bandwagon... No… ...Congress must immediately pass Border Legislation, use Nuclear Option if necessary, to stop the massive inflow o… Mexico has the absolute power not to let these large “Caravans” of people enter their country. They must stop them… These big flows of people are all trying to take advantage of DACA. They want in on the act! Mexico is doing very little, if not NOTHING, at stopping people from flowing into Mexico through their Southern Bor… Border Patrol Agents are not allowed to properly do their job at the Border because of ridiculous liberal (Democrat… HAPPY EASTER! Governor Jerry “Moonbeam” Brown pardoned 5 criminal illegal aliens whose crimes include (1) Kidnapping and Robbery… ...does not include the Fake Washington Post, which is used as a “lobbyist” and should so REGISTER. If the P.O. “i… While we are on the subject, it is reported that the U.S. Post Office will lose $1.50 on average for each package i… Washington spent trillions building up foreign countries while allowing OUR OWN infrastructure to fall into a state… JOBS, JOBS, JOBS! Unemployment claims have fallen to a 45-year low. Together, we are making the economy great again! We are going to REBUILD our crumbling infrastructure, and there is no better place to begin this campaign than in t… I have stated my concerns with Amazon long before the Election. Unlike others, they pay little or no taxes to state… ....In the interim, Hon. Robert Wilkie of DOD will serve as Acting Secretary. I am thankful for Dr. David Shulkin’s… I am pleased to announce that I intend to nominate highly respected Admiral Ronny L. Jackson, MD, as the new Secret… Great briefing this afternoon on the start of our Southern Border WALL! ....release known dangerous criminals into communities across the State. All citizens have the right to be protecte… My Administration stands in solidarity with the brave citizens in Orange County defending their rights against Cali… . just announced an agreement in principle with South Korea on KORUS! A great deal for American and Kore… Received message last night from XI JINPING of China that his meeting with KIM JONG UN went very well and that KIM… For years and through many administrations, everyone said that peace and the denuclearization of the Korean Peninsu… THE SECOND AMENDMENT WILL NEVER BE REPEALED! As much as Democrats would like to see this happen, and despite the wo… I am very pleased to welcome the opioid memorial to the President's Park in April. I encourage all to visit and rem… "
}